exercises/exercise_01_logik.tex
% Created 2025-12-31 Mi 14:01
% Intended LaTeX compiler: xelatex
\documentclass[a4paper,14pt,ngerman]{scrartcl}
\usepackage{graphicx}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{capt-of}
\usepackage{hyperref}
\usepackage{polyglossia}
\usepackage{polyglossia}
\setmainlanguage[variant=german]{german}
\usepackage{polyglossia}
\setdefaultlanguage{german}
\PolyglossiaSetup{german}{shorthands=on}
\AtBeginDocument{\let\babelprovide\relax}
\AtBeginDocument{\let\shorthandon\relax}
\AtBeginDocument{\let\shorthandoff\relax}
\setmainfont{Gentium Book Basic}
\setsansfont{Latin Modern Sans}
\setmonofont{Latin Modern Mono}
\usepackage{fancyhdr}
\usepackage{graphicx}
\usepackage{amsmath,amssymb}
\usepackage{xcolor}
\usepackage{xurl}
\usepackage{listings}
\usepackage{setspace}
\setstretch{1.3}
\author{Elias}
\date{\today}
\title{Übungsblatt 1}
\hypersetup{
 pdfauthor={Elias},
 pdftitle={Übungsblatt 1},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 30.1 (Org mode 9.7.11)}, 
 pdflang={German}}
\begin{document}

\section{\textbf{Übung 1}}
\label{sec:orge217e78}
\subsection{\textbf{Logik}}
\label{sec:org29e84eb}
\subsubsection{\textbf{Aufgabe 1}}
\label{sec:orgef07ed2}

Welche der folgenden aussagenlogischen Ausdrücke sind Tautologien?

\begin{enumerate}
\item \((a \leftrightarrow b) \leftrightarrow (\neg b \leftrightarrow c)\)

\item \(\neg ((a \lor b) \rightarrow c) \lor c\)

\item \(((a \rightarrow b) \land (b \rightarrow c)) \rightarrow (a \rightarrow c)\)
\end{enumerate}
\subsubsection{\textbf{Aufgabe 2}}
\label{sec:org966b51b}

Gegeben sei die Wahrheitstafel für eine Funktion \(F\).

\begin{center}
\begin{tabular}{llll}
A & B & C & F\\
\hline
f & f & f & w\\
f & f & w & f\\
f & w & f & w\\
f & w & w & w\\
w & f & f & f\\
w & f & w & w\\
w & w & f & f\\
w & w & w & w\\
\end{tabular}
\end{center}

\begin{enumerate}
\item Bestimmen Sie aussagenlogische Formeln in DNF und KNF, die diesen
Wahrheitswerteverlauf haben.

\item Minimieren Sie DNF und KNF unter Verwendung eines KV-Diagramms.
\end{enumerate}
\subsubsection{\textbf{Aufgabe 3}}
\label{sec:orgc2382c0}

Auszug aus dem Plädoyer einer Anwältin:

\begin{enumerate}
\item Wenn der Mandant schuldig ist, dann war das Messer im Schrank.

\item Das Messer war nicht im Schrank oder Emma hat das Messer gesehen.

\item Wenn das Messer am 1.10. nicht dort war konnte Emma es nicht sehen.

\item Wenn das Messer am 1.10. dort war, dann war sowohl das Messer im
Schrank als auch der Hammer im Stall.

\item Alle wissen, dass der Hammer nicht im Stall war.

\item Deshalb ist mein Mandant unschuldig.
\end{enumerate}

Wenden Sie logisches Schließen an, um zu zeigen, ob der Mandant schuldig
war.
\subsubsection{\textbf{Aufgabe 4}}
\label{sec:org1ab5513}

Prüfen Sie, ob aus den Prämissen \(A \rightarrow B\) und \(B\) die
Gültigkeit von \(A\) folgt.
\subsubsection{\textbf{Aufgabe 5}}
\label{sec:orgdaca77d}

Untersuchen Sie die Korrektheit des folgenden Schlusses:

\begin{enumerate}
\item Wenn John schwimmen war, dann verlor er seine Brille und ging nicht
ins Kino.

\item Wenn John zu viel Fleisch gegessen hat und nicht ins Kino ging, dann
wird er eine Magenverstimmung erleiden.

\item Also: Wenn John zu viel Fleisch gegessen hat und schwimmen war, dann
wird er eine Magenverstimmung erleiden.
\end{enumerate}
\subsubsection{\textbf{Aufgabe 6}}
\label{sec:org0441500}

Zeigen Sie mittels Resolution, dass
\[F=(\neg A \land \neg B \land C) \lor (\neg A \land \neg C) \lor (B \land C) \lor A\]
eine Tautologie ist.
\subsubsection{\textbf{Aufgabe 7}}
\label{sec:org22df4b9}

Prüfen Sie die Erfüllbarkeit der folgenden Klauselmenge:
\[S = \left\{\{A, \neg B, C\}, \{B, C\}, \{\neg A, C\}, \{B, \neg C\}, \{\neg C\}\right\}\]
Führen Sie dazu die Resolution durch. Bestimmen Sie die
Resolutionsmengen \[S_i=RES_{L_i}(S_{i-1}), S_0=S\] für eine geeignete
Folge der Literale.
\end{document}
